{"src_vocab2index_dict": {"<s>": 0, "</s>": 1, "<pad>": 2, "<unk>": 3, "move": 4, "to": 5, "reach": 6, "the": 7, "navy": 8, "place": 9, "by": 10, "taking": 11, "a": 12, "path": 13, "which": 14, "has": 15, "yellow": 16, "colour": 17, "and": 18, "white": 19, "in": 20, "it": 21, "while": 22, "avoiding": 23, "black": 24, "red": 25, "go": 26, "room": 27, "then": 28, "green": 29, "thru": 30, "purple": 31, "or": 32, "box": 33, "get": 34, "up": 35, "through": 36, "into": 37, "olive": 38, "make": 39, "sure": 40, "lime": 41, "blue": 42, "without": 43, "going": 44, "orange": 45, "but": 46, "avoid": 47, "using": 48, "enter": 49, "door": 50, "exit": 51, "other": 52, "drive": 53, "that": 54, "is": 55, "not": 56, "travel": 57, "pass": 58, "either": 59, "from": 60, "pink": 61, "way": 62, "of": 63, "brown": 64, "robot": 65, "must": 66, "small": 67, "large": 68, "isn": 69, "t": 70, "proceed": 71, "tan": 72, "only": 73, "rooms": 74, "are": 75, "walk": 76, "until": 77, "you": 78, "pick": 79, "chair": 80, "continue": 81, "area": 82, "on": 83, "each": 84, "time": 85, "bring": 86, "towards": 87, "avoids": 88, "thing": 89, "goes": 90, "first": 91, "entering": 92, "do": 93, "use": 94, "before": 95, "navigate": 96, "push": 97, "object": 98, "never": 99, "follow": 100, "square": 101, "rectangular": 102, "item": 103, "via": 104, "non": 105, "head": 106, "straight": 107, "away": 108, "don": 109, "stay": 110, "end": 111, "moves": 112, "progress": 113, "rectangle": 114, "back": 115, "totally": 116, "big": 117, "will": 118, "lead": 119, "out": 120, "throught": 121, "isnt": 122, "instead": 123, "keep": 124, "stop": 125, "when": 126, "take": 127, "cross": 128, "your": 129, "took": 130, "goto": 131, "leads": 132, "at": 133, "passing": 134, "violet": 135, "any": 136, "one": 137, "side": 138, "all": 139, "got": 140, "stepping": 141, "spaces": 142, "once": 143, "after": 144, "toward": 145, "retrieve": 146, "crossing": 147, "opposite": 148, "behind": 149, "find": 150, "c": 151, "passage": 152, "if": 153, "shortest": 154, "always": 155, "proceeding": 156, "there": 157, "over": 158, "rectanglular": 159, "being": 160, "them": 161, "i": 162, "want": 163, "middle": 164, "route": 165, "gain": 166, "access": 167, "down": 168, "return": 169, "hallway": 170, "takes": 171, "though": 172, "except": 173, "grab": 174, "rom": 175, "under": 176, "leave": 177, "this": 178, "left": 179, "right": 180, "ends": 181, "dog": 182, "backpack": 183, "moving": 184, "come": 185, "far": 186, "wall": 187, "color": 188, "with": 189, "please": 190, "backto": 191, "locate": 192, "carry": 193, "across": 194, "front": 195, "below": 196}, "src_index2vocab_dict": {"0": "<s>", "1": "</s>", "2": "<pad>", "3": "<unk>", "4": "move", "5": "to", "6": "reach", "7": "the", "8": "navy", "9": "place", "10": "by", "11": "taking", "12": "a", "13": "path", "14": "which", "15": "has", "16": "yellow", "17": "colour", "18": "and", "19": "white", "20": "in", "21": "it", "22": "while", "23": "avoiding", "24": "black", "25": "red", "26": "go", "27": "room", "28": "then", "29": "green", "30": "thru", "31": "purple", "32": "or", "33": "box", "34": "get", "35": "up", "36": "through", "37": "into", "38": "olive", "39": "make", "40": "sure", "41": "lime", "42": "blue", "43": "without", "44": "going", "45": "orange", "46": "but", "47": "avoid", "48": "using", "49": "enter", "50": "door", "51": "exit", "52": "other", "53": "drive", "54": "that", "55": "is", "56": "not", "57": "travel", "58": "pass", "59": "either", "60": "from", "61": "pink", "62": "way", "63": "of", "64": "brown", "65": "robot", "66": "must", "67": "small", "68": "large", "69": "isn", "70": "t", "71": "proceed", "72": "tan", "73": "only", "74": "rooms", "75": "are", "76": "walk", "77": "until", "78": "you", "79": "pick", "80": "chair", "81": "continue", "82": "area", "83": "on", "84": "each", "85": "time", "86": "bring", "87": "towards", "88": "avoids", "89": "thing", "90": "goes", "91": "first", "92": "entering", "93": "do", "94": "use", "95": "before", "96": "navigate", "97": "push", "98": "object", "99": "never", "100": "follow", "101": "square", "102": "rectangular", "103": "item", "104": "via", "105": "non", "106": "head", "107": "straight", "108": "away", "109": "don", "110": "stay", "111": "end", "112": "moves", "113": "progress", "114": "rectangle", "115": "back", "116": "totally", "117": "big", "118": "will", "119": "lead", "120": "out", "121": "throught", "122": "isnt", "123": "instead", "124": "keep", "125": "stop", "126": "when", "127": "take", "128": "cross", "129": "your", "130": "took", "131": "goto", "132": "leads", "133": "at", "134": "passing", "135": "violet", "136": "any", "137": "one", "138": "side", "139": "all", "140": "got", "141": "stepping", "142": "spaces", "143": "once", "144": "after", "145": "toward", "146": "retrieve", "147": "crossing", "148": "opposite", "149": "behind", "150": "find", "151": "c", "152": "passage", "153": "if", "154": "shortest", "155": "always", "156": "proceeding", "157": "there", "158": "over", "159": "rectanglular", "160": "being", "161": "them", "162": "i", "163": "want", "164": "middle", "165": "route", "166": "gain", "167": "access", "168": "down", "169": "return", "170": "hallway", "171": "takes", "172": "though", "173": "except", "174": "grab", "175": "rom", "176": "under", "177": "leave", "178": "this", "179": "left", "180": "right", "181": "ends", "182": "dog", "183": "backpack", "184": "moving", "185": "come", "186": "far", "187": "wall", "188": "color", "189": "with", "190": "please", "191": "backto", "192": "locate", "193": "carry", "194": "across", "195": "front", "196": "below"}, "tar_vocab2index_dict": {"<s>": 0, "</s>": 1, "<pad>": 2, "F": 3, "&": 4, "Y": 5, "B": 6, "C": 7, "|": 8, "R": 9, "G": 10, "!": 11, "X": 12, "Z": 13}, "tar_index2vocab_dict": {"0": "<s>", "1": "</s>", "2": "<pad>", "3": "F", "4": "&", "5": "Y", "6": "B", "7": "C", "8": "|", "9": "R", "10": "G", "11": "!", "12": "X", "13": "Z"}}